STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
/**
  ******************************************************************************
  * @file    gui_api.c
  * @author  MCD Application Team
  * @brief   GUI_API provides functions associated with answers the MCU can send
             to the computer via UART.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#if defined(_GUI_INTERFACE)

#define GUI_API_C

#include <stdlib.h>
#include "usbpd_core.h"
#include "gui_api.h"
#include "bsp_gui.h"
#include "data_struct_tlv.h"
#include "usbpd_dpm_core.h"
#include "usbpd_trace.h"
#include "usbpd_dpm_user.h"
#include "usbpd_dpm_conf.h"
#include "tracer_emb.h"
#ifdef _VDM
#include "usbpd_vdm_user.h"
#endif /* _VDM */
#include "usbpd_pdo_defs.h"
#ifndef USBPD_TCPM_MODULE_ENABLED
//#include "usbpd_hw_if.h"
#else
#include "usbpd_tcpci.h"
#endif
#if defined(_RTOS)
#include "cmsis_os.h"
#endif /*_RTOS*/
#include "string.h"

/* generic hal function valid for all stm32 */
extern uint32_t HAL_GetTick(void);
extern void HAL_NVIC_SystemReset(void);
extern void USBPD_DPM_TraceWakeUp(void);

/** @addtogroup STM32_USBPD_LIBRARY
  * @{
  */

/** @addtogroup USBPD_GUI_API
  * @{
  */

/* Private enums -------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup USBPD_GUI_API_Private_Defines USBPD GUI API Private Defines
  * @{
  */

#if !defined(USBPD_FW_VERSION)
#define USBPD_FW_VERSION          0xFFFFFFFFU
#endif /* !USBPD_FW_VERSION */

#if !defined(USBPD_START_PORT_NUMBER)
#define USBPD_START_PORT_NUMBER   0U
#endif /* !USBPD_START_PORT_NUMBER */

#define GUI_PORT_BIT_POSITION     5u /* Bit position of port number in TAG id */

#define GUI_BOX_MESSAGES_MAX      30u

#define GUI_TIMER_ENABLE_MSK      ((uint16_t)0x8000U)       /*!< Enable Timer Mask                                                        */
#define GUI_TIMER_READ_MSK        ((uint16_t)0x7FFFU)       /*!< Read Timer Mask                                                          */

#if defined(USBPDCORE_SNK_CAPA_EXT)
#define GUI_VDM_CABLE_INFO      USBPD_CORE_SNK_EXTENDED_CAPA + 1U
#else
#define GUI_VDM_CABLE_INFO      USBPD_CORE_UNSTRUCTURED_VDM + 1U
#endif /* USBPDCORE_SNK_CAPA_EXT */

#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
#define GUI_STACK_SIZE_ADDON_FOR_CMSIS              1
#else
#define GUI_STACK_SIZE_ADDON_FOR_CMSIS              5
#endif /* osCMSIS < 0x20000U */
#define FREERTOS_GUI_PRIORITY                   osPriorityLow
#define FREERTOS_GUI_STACK_SIZE                 (120 * GUI_STACK_SIZE_ADDON_FOR_CMSIS)
#endif /*_RTOS*/

/**
  * @brief  USB PD GUI REJECT REASON
  */
typedef enum
{
  GUI_REJ_DPM_REJECT                         = 0x00, /*<! Use in DPM_CONFIG_REJ */
  GUI_REJ_DPM_BUSY                           = 0x01, /*<! Use in DPM_CONFIG_REJ */
  GUI_REJ_DPM_TIMEOUT                        = 0x02, /*<! Use in DPM_CONFIG_REJ */
  GUI_REJ_DPM_INVALID_MESSAGE                = 0x03, /*<! Use in DPM_CONFIG_REJ (incorrect param in DPM_CONFIG_GET) */
  GUI_REJ_DPM_OUT_OF_RANGE                   = 0x04, /*<! Use in DPM_CONFIG_REJ */
  GUI_REJ_DPM_INVALID_PORT_NUMBER            = 0x05, /*<! Use in DPM_CONFIG_REJ */
  GUI_REJ_DPM_NOT_READY                      = 0x06, /*<! Use in DPM_MESSAGE_REJ */
} USBPD_GUI_Reject_Reason;

/**
  * @brief  USB PD GUI REGISTER TCPC
  */
#define GUI_REG_NUMBER_OF_REGISTERS          39
typedef enum
{
  GUI_REG_VENDOR_ID                          = 0x00, /*<! VENDOR_ID */
  GUI_REG_PRODUCT_ID                         = 0x02, /*<! PRODUCT_ID */
  GUI_REG_DEVICE_ID                          = 0x04, /*<! DEVICE_ID */
  GUI_REG_USBTYPEC_REV                       = 0x06, /*<! USBTYPEC_REV */
  GUI_REG_USBPD_REV_VER                      = 0x08, /*<! USBPD_REV_VER */
  GUI_REG_USBPD_INTERFACE_REV                = 0x0A, /*<! USBPD_INTERFACE_REV */
  GUI_REG_ALERT                              = 0x10, /*<! ALERT */
  GUI_REG_ALERT_MASK                         = 0x12, /*<! ALERT_MASK */
  GUI_REG_POWER_STATUS_MASK                  = 0x14, /*<! POWER_STATUS_MASK */
  GUI_REG_FAULT_STATUS_MASK                  = 0x15, /*<! FAULT_STATUS_MASK */
  GUI_REG_CONFIG_STANDARD_OUTPUT             = 0x18, /*<! CONFIG_STANDARD_OUTPUT */
  GUI_REG_TCPC_CONTROL                       = 0x19, /*<! TCPC_CONTROL */
  GUI_REG_ROLE_CONTROL                       = 0x1A, /*<! ROLE_CONTROL */
  GUI_REG_FAULT_CONTROL                      = 0x1B, /*<! FAULT_CONTROL */
  GUI_REG_POWER_CONTROL                      = 0x1C, /*<! POWER_CONTROL */
  GUI_REG_CC_STATUS                          = 0x1D, /*<! CC_STATUS */
  GUI_REG_POWER_STATUS                       = 0x1E, /*<! POWER_STATUS */
  GUI_REG_FAULT_STATUS                       = 0x1F, /*<! FAULT_STATUS */
  GUI_REG_COMMAND                            = 0x23, /*<! COMMAND */
  GUI_REG_DECIVE_CAP1                        = 0x24, /*<! DECIVE_CAP1 */
  GUI_REG_DECIVE_CAP2                        = 0x26, /*<! DECIVE_CAP2 */
  GUI_REG_STD_INPUT_CAP                      = 0x28, /*<! STD_INPUT_CAP */
  GUI_REG_STD_OUTPUT_CAP                     = 0x29, /*<! STD_OUTPUT_CAP */
  GUI_REG_MSG_HEADER_INFO                    = 0x2E, /*<! MSG_HEADER_INFO */
  GUI_REG_RX_DETECT                          = 0x2F, /*<! RX_DETECT */
  GUI_REG_RX_BYTE_COUNT                      = 0x30, /*<! RX_BYTE_COUNT */
  GUI_REG_RX_BUFFER_FRAME_TYPE               = 0x31, /*<! RX_BUFFER_FRAME_TYPE */
  GUI_REG_RX_HEADER                          = 0x32, /*<! RX_HEADER */
  GUI_REG_RX_DATA                            = 0x34, /*<! RX_DATA */
  GUI_REG_TRANSMIT                           = 0x50, /*<! TRANSMIT */
  GUI_REG_TX_BYTE_COUNT                      = 0x51, /*<! TX_BYTE_COUNT */
  GUI_REG_TX_HEADER                          = 0x52, /*<! TX_HEADER */
  GUI_REG_TX_DATA                            = 0x54, /*<! TX_DATA */
  GUI_REG_VBUS_VOLTAGE                       = 0x70, /*<! VBUS_VOLTAGE */
  GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD     = 0x72, /*<! VBUS_SINK_DISCONNECT_THRESHOLD */
  GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD      = 0x74, /*<! VBUS_STOP_DISCHARGE_THRESHOLD */
  GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG          = 0x76, /*<! VBUS_VOLTAGE_ALARM_HI_CFG */
  GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG          = 0x78, /*<! VBUS_VOLTAGE_ALARM_LO_CFG */
  GUI_REG_VENDOR_DATA                        = 0x80, /*<! VENDOR_DATA */
} USBPD_GUI_RegisterTCPC;

/**
  * @brief  USB PD GUI TAG PARAM
  */
typedef enum
{
  GUI_PARAM_SOP                              = 0x00, /*<! SOP support */
  GUI_PARAM_SOP1                             = 0x00, /*<! SOP prime support */
  GUI_PARAM_SOP2                             = 0x00, /*<! SOP second support */
  GUI_PARAM_FASTROLESWAP                     = 0x02, /*<! It enables the FRS */
  GUI_PARAM_DATAROLESWAP_TO_UFP              = 0x03, /*<! Support of Data role swap to UFP */
  GUI_PARAM_DEFAULTPOWERROLE                 = 0x04, /*<! DRP on PE side but no toggle on CAD (dependancy with CADRoleToggle) */
  GUI_PARAM_DRP_SUPPORT                      = 0x05, /*<! DRP support (Power Role swap support) */
  GUI_PARAM_CADROLETOGGLE                    = 0x06, /*<! CAD Role Toggle */
  GUI_PARAM_PE_SCAP_HR                       = 0x07, /*<! Hard reset after N_SOURCE_CAPS message sending tentatives */
  GUI_PARAM_VCONNSWAP                        = 0x08, /*<! It enables or disables the VCONN swap capability */
  GUI_PARAM_VDM_SUPPORT                      = 0x09, /*<! Indicate if VDM messages support is enabled or not */
  GUI_PARAM_PING_SUPPORT                     = 0x0A, /*<! Indicate if Ping message support is enabled or not */
  GUI_PARAM_PPS_SUPPORT                      = 0x0B, /*<! PPS message supported by PE  */
  GUI_PARAM_SRCCAPAEXTSUPPORT                = 0x0B, /*<! Source_Capabilities_Extended message supported by PE  */
  GUI_PARAM_ALERTSUPPORT                     = 0x0B, /*<! Alert message supported by PE  */
  GUI_PARAM_STATUSSUPPORT                    = 0x0B, /*<! Status message supported by PE (Is_Alert_Supported should be enabled)  */
  GUI_PARAM_BATTERYSTATUSSUPPORT             = 0x0B, /*<! Battery_Status message supported by PE  */
  GUI_PARAM_BATTERYCAPASUPPORT               = 0x0B, /*<! Battery_Capabilities message supported by PE  */
  GUI_PARAM_MANUINFOSUPPORT                  = 0x0B, /*<! Manufacturer_Info message supported by PE  */
  GUI_PARAM_COUNTRYCODESSUPPORT              = 0x0B, /*<! Country_Codes message supported by PE  */
  GUI_PARAM_COUNTRYINFOSUPPORT               = 0x0B, /*<! Country_Info message supported by PE  */
  GUI_PARAM_SECURESPONSESUPPORT              = 0x0B, /*<! Security_Response message supported by PE  */
  GUI_PARAM_SNK_PDO                          = 0x0C, /*<! maximun 7 * 32bit */
  GUI_PARAM_SRC_PDO                          = 0x0D, /*<! maximun 7 * 32bit */
  GUI_PARAM_TDRP                             = 0x0E, /*<! The period a DRP shall complete a Source to Sink and back advertisement */
  GUI_PARAM_DCSRC_DRP                        = 0x0F, /*<! The percent of time that a DRP shall advertise Source during tDRP (in %) */
  GUI_PARAM_RESPONDS_TO_DISCOV_SOP           = 0x10, /*<! UUT can respond successfully to a Discover Identity command from its port partner using SOP. */
  GUI_PARAM_ATTEMPTS_DISCOV_SOP              = 0x11, /*<! UUT can send a Discover Identity command to its port partner using SOP */
  GUI_PARAM_XID_SOP                          = 0x12, /*<! A decimal number assigned by USB-IF before certification */
  GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP     = 0x13, /*<! Indicates whether the UUT is capable of enumerating USB Host */
  GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP   = 0x14, /*<! Indicates whether the UUT is capable of enumerating as a USB Device */
  GUI_PARAM_PRODUCT_TYPE_SOP                 = 0x15, /*<! What is the product type of the UUT?  */
  GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP    = 0x16, /*<! Does the product support Modes?  */
  GUI_PARAM_USB_VID_SOP                      = 0x17, /*<! A unique 16-bit number, assigned to the Vendor by USB-IF. */
  GUI_PARAM_PID_SOP                          = 0x18, /*<! A unique number assigned by the Vendor ID holder identifying the product */
  GUI_PARAM_BCDDEVICE_SOP                    = 0x19, /*<! A unique number assigned by the Vendor ID holder containing identity information relevant to the release version of the product.  */
  GUI_PARAM_MEASUREREPORTING                 = 0x1A, /*<! 0x00: Disable Measure reporting
                                                          (1 << 8) | (tr between 0 & 127): Enable Measure reporting every tr x 40 ms (if xx = 0 means only 1 indication to report to GUI) */
  GUI_PARAM_MANUINFOPORT_VID                 = 0x1B, /*<! Vendor ID (assigned by the USB-IF)) used by Manufacturer info  set for port */
  GUI_PARAM_MANUINFOPORT_PID                 = 0x1B, /*<! Product ID (assigned by the manufacturer) used by Manufacturer info  set for port */
  GUI_PARAM_MANUINFOPORT_STRING              = 0x1B, /*<! Vendor string used by Manufacturer info  set for port */
  GUI_PARAM_DATAROLESWAP_TO_DFP              = 0x1C, /*<! Support of Data role swap to DFP */
  GUI_PARAM_NB_TAG                           = (GUI_PARAM_MANUINFOPORT_STRING + 1), /*<! Number max of param */
  GUI_PARAM_ALL                              = 0xFFu,
} USBPD_GUI_Tag_Param;

/**
  * @brief  USB PD GUI TAG INDICATION
  */
typedef enum
{
  GUI_IND_NUMBEROFRCVSNKPDO                  = 0x00, /*<! The number of received Sink Power Data Objects from port Partner (when Port partner is a Sink or a DRP port) */
  GUI_IND_RDOPOSITION                        = 0x01, /*<!  RDO Position of requested DO in Source list of capabilities */
  GUI_IND_LISTOFRCVSRCPDO                    = 0x02, /*<! The list of received Source Power Data Objects from Port partner (when Port partner is a Source or a DRP port) */
  GUI_IND_NUMBEROFRCVSRCPDO                  = 0x03, /*<! The number of received Source Power Data Objects from port Partner (when Port partner is a Source or a DRP port) */
  GUI_IND_LISTOFRCVSNKPDO                    = 0x04, /*<! The list of received Sink Power Data Objects from Port partner (when Port partner is a Sink or a DRP port) */
  GUI_IND_ISCONNECTED                        = 0x05, /*<! USB PD connection state */
  GUI_IND_CC                                 = 0x06, /*<! CC side */
  GUI_IND_DATAROLE                           = 0x07, /*<! It defines the initial data role. */
  GUI_IND_POWERROLE                          = 0x08, /*<! It defines the power role. */
  GUI_IND_CCDEFAULTCURRENTADVERTISED         = 0x09, /*<! advertising the current capability */
  GUI_IND_VCONNON                            = 0x0A, /*<! Vconn Status */
  GUI_IND_VBUS_LEVEL                         = 0x0C, /*<! VBUS level (in mV) */
  GUI_IND_IBUS_LEVEL                         = 0x0C, /*<! IBUS level (in mA) */
  GUI_IND_PD_SPECREVISION                    = 0x0D, /*<! Selected Specification revision */
  GUI_IND_PD_MESSAGENOTIF                    = 0x0E, /*<! Send notifications of PD messages */
  GUI_IND_NBBATTERIES                        = 0x0F, /*<! Number of batteries supported by the devices. */
  GUI_IND_COUNTRYCODES                       = 0x10, /*<! List of the country codes received in the COUNTRY_CODES message */
  GUI_IND_SVDM_SVIDS                         = 0x11, /*<! List of the SVDM SVID received in the SVDM Discovery SVID message */
  GUI_IND_SVDM_MODES                         = 0x12, /*<! List of the country codes received in the SVDM Discovery SVID message */
  GUI_IND_TIMESTAMP                          = 0x13, /*<! Timestamp used for VBUS and IBUS values */
  GUI_IND_PPS                                = 0x14, /*<! PPS value based on @ref USBPD_PPSSDB_TypeDef */
  GUI_IND_STATUS                             = 0x15, /*<! Status value based on @ref USBPD_SDB_TypeDef */
  GUI_IND_VDM_IDENTITY                       = 0x16, /*<! VDM Identity based on @ref USBPD_IDHeaderVDO_TypeDef */
  GUI_IND_CABLE_VDO                          = 0x19, /*<! VDM Cable Object based on @ref USBPD_CableVdo_TypeDef */
  GUI_IND_ALL                                = (GUI_IND_CABLE_VDO + 1), /*<! Number max of indication */
} USBPD_GUI_Tag_Indication;

/**
  * @brief  USB PD GUI TAG PARAM_MSG
  */
typedef enum
{
  GUI_PARAM_MSG_SOPTYPE                      = 0x00, /*<! SOP type used for DPM_MESSAGE_REQ */
  GUI_PARAM_MSG_RDOPOSITION                  = 0x01, /*<! RDO position of Received SRC PDO (used for RESET_REQ) */
  GUI_PARAM_MSG_REQUESTEDVOLTAGE             = 0x02, /*<! Requested voltage in REQUEST message (in mV) */
  GUI_PARAM_MSG_ALERTMSG                     = 0x04, /*<! Alert message used in ALERT message */
  GUI_PARAM_MSG_COUNTRYCODE                  = 0x05, /*<! Coutry code used in GET_COUNTRY_INFO message */
  GUI_PARAM_MSG_SVDM_SVID                    = 0x06, /*<! SVID used in SVDM disco mode, enter mode & exit mode */
  GUI_PARAM_MSG_SVDM_MODEINDEX               = 0x07, /*<! Mode index used in SVDM enter and exit mode messages */
  GUI_PARAM_MSG_UVDM_DATA                    = 0x08, /*<! Data used in UVDM message */
  GUI_PARAM_MSG_DP_STATUS                    = 0x09, /*<! Data used in DP status message */
  GUI_PARAM_MSG_DP_CONFIGURE                 = 0x0A, /*<! Data used in DP config message */
  GUI_PARAM_MSG_DP_ATTENTION                 = 0x0B, /*<! Data used in DP attention message */
  GUI_PARAM_MSG_BATTERYREF                   = 0x0C, /*<! Battery reference used in Get battery capa & status message */
  GUI_PARAM_MSG_MANUINFODATA                 = 0x0D, /*<! Manufacturer_Info data used in Get Manufacturer info message */
  GUI_PARAM_MSG_FREE_TEXT                    = 0x0E, /*<! Free text */
  GUI_PARAM_MSG_ALL                          = (GUI_PARAM_MSG_FREE_TEXT + 1), /*<! Number max of msg param */
} USBPD_GUI_Tag_ParamMsg;

/**
  * @brief  USB PD GUI MESSAGES
  */
typedef enum
{
  GUI_MSG_GOTOMIN                            = 0x00, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_PING                               = 0x01, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_SRC_CAPA                       = 0x03, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_SNK_CAPA                       = 0x04, /*<! Message sent only if port partner is DRP. Answer to this message is a SNK_CAPA
                                                          Note: Refer to Control message in USB_PD specv3.0
                                                           */
  GUI_MSG_DR_SWAP                            = 0x05, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_PR_SWAP                            = 0x06, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_VCONN_SWAP                         = 0x07, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_SOFT_RESET                         = 0x08, /*<! Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_SOURCE_CAPA_EXTENDED           = 0x09, /*<! Specific to PD3.0
                                                          Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_STATUS                         = 0x0A, /*<! Specific to PD3.0. Return a STATUS message
                                                          Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_FR_SWAP                            = 0x0B, /*<! Specific to PD3.0
                                                          Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_PPS_STATUS                     = 0x0C, /*<! Specific to PD3.0. Wait for PPS_STATUS message
                                                          Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_GET_COUNTRY_CODES                  = 0x0D, /*<! Specific to PD3.0. Return a COUNTRY_CODES message
                                                          Note: Refer to Control message in USB_PD specv3.0 */
  GUI_MSG_SOURCE_CAPA                        = 0x0E, /*<! DPM_CONFIG_SET_REQ to be sent before sending this message
                                                          Note: Refer to data message in USB_PD specv3.0 */
  GUI_MSG_REQUEST                            = 0x0F, /*<! Select one of the capability available.
                                                          Note: Refer to data message in USB_PD specv3.0  */
  GUI_MSG_ALERT                              = 0x11, /*<! Specific to PD3.0
                                                          Note: Refer to data message in USB_PD specv3.0 */
  GUI_MSG_GET_COUNTRY_INFO                   = 0x12, /*<! Return COUNTRY_INFO message.
                                                          Note: Refer to data message in USB_PD specv3.0 */
  GUI_MSG_VDM_DISCO_IDENT                    = 0x13, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_DISCO_SVID                     = 0x14, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_DISCO_MODE                     = 0x15, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_ENTER_MODE                     = 0x16, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_EXIT_MODE                      = 0x17, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_ATTENTION                      = 0x18, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_VDM_UNSTRUCTURED                   = 0x19, /*<! 1..7 x 32bit
                                                          Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_FREE_TEXT                          = 0x1A, /*<! Free text */
  GUI_MSG_DISPLAY_PORT_STATUS                = 0x20, /*<! 1..7 x 32bit
                                                          Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_DISPLAY_PORT_CONFIG                = 0x21, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_DISPLAY_PORT_ATTENTION             = 0x22, /*<! Note: Refer to VDM message in USB_PD specv3.0 */
  GUI_MSG_HARD_RESET                         = 0x24, /*<! Note: refer to Reset messages in USB_PD specv3.0 */
  GUI_MSG_CABLE_RESET                        = 0x25, /*<! Note: refer to Reset messages in USB_PD specv3.0 */
  GUI_MSG_GET_BAT_CAPA                       = 0x26, /*<! Return BAT_CAPA message
                                                          Note: Refer to extended message in USB_PD specv3.0 */
  GUI_MSG_GET_BAT_STATUS                     = 0x27, /*<! Return BAT_STATUS message
                                                          Note: Refer to extended message in USB_PD specv3.0 */
  GUI_MSG_GET_MANU_INFO                      = 0x28, /*<! Return MANU_INFO message
                                                          Note: Refer to extended message in USB_PD specv3.0 */
  GUI_MSG_SECU_REQUEST                       = 0x29, /*<! Note: Refer to extended message in USB_PD specv3.0 */
  GUI_MSG_FIRM_UPDATE_REQUEST                = 0x2A, /*<! Note: Refer to extended message in USB_PD specv3.0 */
  GUI_MSG_GET_SINK_CAPA_EXTENDED             = 0x2B, /*<! Specific to PD3.0
                                                            Note: Refer to Control message in USB_PD specv3.0 */
} USBPD_GUI_Messages;

