STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
/**
  * @brief  USB PD GUI INIT
  */
typedef enum
{
  GUI_INIT_HWBOARDVERSION                    = 0x00, /*<! ASCII stream to indicate STM32 version like STM32F032xB */
  GUI_INIT_HWPDTYPE                          = 0x01, /*<! ASCII stream to indicate PD type used by the devices like:
                                                          - AFE solution (MB1257B)
                                                          - 1602 solution (MB1303 rev A)
                                                          - TCPM solution (TCPC FUSB305)
                                                          - () */
  GUI_INIT_NBPORTMAX                         = 0x02, /*<! Indicate maximum number of ports which can be configured in the device (value 1, 2 , 3) */
  GUI_INIT_FWVERSION                         = 0x03, /*<! 4 bytes for FW version + 4 bytes for Stack version */
  GUI_INIT_TYPECSPECREVISION                 = 0x04, /*<! Type-C revision supported by the port */
  GUI_INIT_PDSPECREVISION                    = 0x04, /*<! PD spec revision supported by the port */
  GUI_INIT_EXTENDEDMESSAGESUNCKUNKED         = 0x06, /*<! Supports extended messages */
  GUI_INIT_ACCESSORYSUPP                     = 0x07, /*<! Accessory supported ot not */
  GUI_INIT_POWERACCESSORYDETECTION           = 0x08, /*<! It enables or disables powered accessory detection */
  GUI_INIT_POWERACCESSORYTRANSITION          = 0x09, /*<! It enables or disables transition from Powered.accessory to Try.SNK */
  GUI_INIT_ISCABLE                           = 0x0B, /*<! Cable (asserts Ra on VConn, communicates using SOP' and SOP''), when this mode is selected the stack will run in cable mode so all parameters like PowerRole are not used */
  GUI_INIT_TRYFEATURE                        = 0x10, /*<! Try Feature  */
  GUI_INIT_RPRESISTORVALUE                   = 0x12, /*<! RP resistor value */
  GUI_INIT_USBSUPPORT                        = 0x13, /*<! USB_Comms_Capable, is the UUT capable of enumerating as a USB host or device? */
  GUI_INIT_USBDEVICE                         = 0x14, /*<! Type_C_Can_Act_As_Device, Indicates whether the UUT can communicate with USB 2.0 or USB 3.1 as a device or as the Upstream Facing Port of a hub.  */
  GUI_INIT_USBHOST                           = 0x15, /*<!  Type_C_Can_Act_As_Host, Indicates whether the UUT can communicate with USB 2.0 or USB 3.1 as a host or as the Downstream Facing Port of a hub */
  GUI_INIT_UNCONSTRAINED_POWERED             = 0x16, /*<! UUT has an external power source available that is sufficient to adequately power the system while charging external devices or the UUTs primary function is to charge external devices. */
  GUI_INIT_USBSUSPENDSUPPORT                 = 0x17, /*<! USB Suspend support */
  GUI_INIT_VCONNDISCHARGE                    = 0x18, /*<! It enables or disables the VCONN discharge on CC pin */
  GUI_INIT_VCONNILIM                         = 0x19, /*<! enables or not VconnLim */
  GUI_INIT_VCONNILIMVALUE                    = 0x1A, /*<! It allows changing the default current limit supplying VCONN on the CC pins */
  GUI_INIT_VCONNMONITORING                   = 0x1B, /*<! It enables or disables UVLO threshold detection on VCONN pin */
  GUI_INIT_VCONNTHRESHOLDUVLO                = 0x1C, /*<! High UVLO threshold of 4.65 V; 1b: Low UVLO threshold of 2.65 V (case of VCONN-powered accessories operating down to 2.7 V) */
  GUI_INIT_VCONNSUPPLY                       = 0x1D, /*<! It enables or disables the VCONN supply capability on CC pin  */
  GUI_INIT_NB_PORT_START                     = 0x1E, /*<! Start Port number                                             */
  GUI_INIT_ORIGINAL_SETTINGS                 = 0x1F, /*<! This flag allows to know if the user settings read by the FW are from the original FW or a previous configuration saved by the user.                                             */
} USBPD_GUI_Init;

typedef enum {
  GUI_USER_EVENT_TIMER,         /* TIMER EVENT */
  GUI_USER_EVENT_GUI,           /* GUI EVENT */
  GUI_USER_EVENT_NONE,          /* NO EVENT */
} GUI_USER_EVENT;

/**
  * @brief  USBPD DPM handle Structure definition
  * @{
  */
typedef struct
{
  uint32_t                      ListOfRcvSRCPDO[USBPD_MAX_NB_PDO];   /*!< The list of received Source Power Data Objects from Port partner
                                                                              (when Port partner is a Source or a DRP port).                       */
  uint32_t                      NumberOfRcvSRCPDO;                   /*!< The number of received Source Power Data Objects from port Partner
                                                                              (when Port partner is a Source or a DRP port).
                                                                              This parameter must be set to a value lower than USBPD_MAX_NB_PDO    */
  uint32_t                      ListOfRcvSNKPDO[USBPD_MAX_NB_PDO];   /*!< The list of received Sink Power Data Objects from Port partner
                                                                              (when Port partner is a Sink or a DRP port).                         */
  uint32_t                      NumberOfRcvSNKPDO;                   /*!< The number of received Sink Power Data Objects from port Partner
                                                                              (when Port partner is a Sink or a DRP port).
                                                                              This parameter must be set to a value lower than USBPD_MAX_NB_PDO    */
  uint32_t                      RDOPosition;                         /*!< RDO Position of requested DO in Source list of capabilities          */
  uint32_t                      RequestedVoltage;                    /*!< Value of requested voltage                                           */
  uint32_t                      RequestedCurrent;                    /*!< Value of requested current                                           */
  uint32_t                      RDOPositionPrevious;                 /*!< RDO Position of previous requested DO in Source list of capabilities */
  uint32_t                      RcvRequestDOMsg;                     /*!< Received request Power Data Object message from the port Partner     */
#if defined(USBPD_REV30_SUPPORT)
#if _STATUS
  USBPD_SDB_TypeDef             RcvStatus;                           /*!< Status received by port partner                                      */
#endif /* _STATUS */
#if _PPS
  USBPD_PPSSDB_TypeDef          RcvPPSStatus;                        /*!< PPS Status received by port partner                                  */
#endif /* _PPS */
#if _SRC_CAPA_EXT
  USBPD_SCEDB_TypeDef           RcvSRCExtendedCapa;                  /*!< SRC Extended Capability received by port partner                     */
#endif /* _SRC_CAPA_EXT */
  USBPD_SKEDB_TypeDef           RcvSNKExtendedCapa;                  /*!< SNK Extended Capability received by port partner                     */
#if _MANU_INFO
  USBPD_GMIDB_TypeDef           GetManufacturerInfo;                 /*!< Get Manufacturer Info                                                */
#endif /* _MANU_INFO */
#if _BATTERY
  USBPD_GBSDB_TypeDef           GetBatteryStatus;                    /*!< Get Battery status                                                   */
  USBPD_GBCDB_TypeDef           GetBatteryCapability;                /*!< Get Battery Capability                                               */
  USBPD_BSDO_TypeDef            BatteryStatus;                       /*!< Battery status                                                       */
#endif /* _BATTERY */
  USBPD_ADO_TypeDef             RcvAlert;                            /*!< Save the Alert received by port partner                              */
#endif /* USBPD_REV30_SUPPORT */
#ifdef _VCONN_SUPPORT
  USBPD_DiscoveryIdentity_TypeDef VDM_DiscoCableIdentify;                /*!< VDM Cable Discovery Identify                                         */
#endif /* _VCONN_SUPPORT */
#ifdef _VDM
  USBPD_DiscoveryIdentity_TypeDef   VDM_DiscoIdentify;                   /*!< VDM Discovery Identify                                               */
  USBPD_SVIDPortPartnerInfo_TypeDef VDM_SVIDPortPartner;                 /*!< VDM SVID list                                                        */
  USBPD_ModeInfo_TypeDef            VDM_ModesPortPartner;                /*!< VDM Modes list                                                       */
#endif /* _VDM */
} GUI_HandleTypeDef;

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup USBPD_GUI_API_Private_Macros USBPD GUI API Private Macros
  * @{
  */
#define __GUI_SET_TAG_ID(_PORT_, _TAG_)  ((_PORT_) << GUI_PORT_BIT_POSITION | (_TAG_))

#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
#define GUI_START_TIMER(_PORT_,_TIMER_,_TIMEOUT_)   do{                                                               \
                                                      _TIMER_[_PORT_] = (_TIMEOUT_) |  GUI_TIMER_ENABLE_MSK;          \
                                                      osMessagePut(GUIMsgBox,GUI_USER_EVENT_TIMER, 0);                \
                                                    }while(0);
#else
#define GUI_START_TIMER(_PORT_,_TIMER_,_TIMEOUT_)   do{                                                               \
                                                      uint32_t event = GUI_USER_EVENT_TIMER;                          \
                                                      _TIMER_[_PORT_] = (_TIMEOUT_) |  GUI_TIMER_ENABLE_MSK;          \
                                                      (void)osMessageQueuePut(GUIMsgBox, &event, 0U, 0U);             \
                                                    }while(0);
#endif /* osCMSIS < 0x20000U */
#else
#define GUI_START_TIMER(_PORT_, _TIMER_,_TIMEOUT_)  _TIMER_[_PORT_] = (_TIMEOUT_) |  GUI_TIMER_ENABLE_MSK;
#endif /* _RTOS */

