STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
  /* Need to update CAD_tDRP & CAD_dcSRC_DRP if CAD_SNKToggleTime not initialized */
  if ((0U == DPM_Settings[USBPD_PORT_0].CAD_SNKToggleTime) || (0U == DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime))
  {
    DPM_USER_Settings[USBPD_PORT_0].CAD_tDRP      = 80U;
    DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP = 50U;
  }
  else
  {
    DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP = (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime * 100) / (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime + DPM_Settings[USBPD_PORT_0].CAD_SNKToggleTime);
    DPM_USER_Settings[USBPD_PORT_0].CAD_tDRP = (DPM_Settings[USBPD_PORT_0].CAD_SRCToggleTime * 100) / DPM_USER_Settings[USBPD_PORT_0].CAD_dcSRC_DRP;
  }
#if USBPD_PORT_COUNT==2
  if ((0U == DPM_Settings[USBPD_PORT_1].CAD_SNKToggleTime) || (0U == DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime))
  {
    DPM_USER_Settings[USBPD_PORT_1].CAD_tDRP      = 80U;
    DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP = 50U;
  }
  else
  {
    DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP = (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime * 100) / (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime + DPM_Settings[USBPD_PORT_1].CAD_SNKToggleTime);
    DPM_USER_Settings[USBPD_PORT_1].CAD_tDRP = (DPM_Settings[USBPD_PORT_1].CAD_SRCToggleTime * 100) / DPM_USER_Settings[USBPD_PORT_1].CAD_dcSRC_DRP;
  }
#endif /* USBPD_PORT_COUNT==2 */


  pCB_HWBoardVersion  = CB_HWBoardVersion;
  pCB_HWPDType        = CB_HWPDType;
  pCB_GetVoltage      = CB_GetVoltage;
  pCB_GetCurrent      = CB_GetCurrent;

  /* Register 2 callbacks for notification in DPM */
  USBPD_DPM_SetNotification_GUI(GUI_FormatAndSendNotification, GUI_PostNotificationMessage, GUI_SaveInfo);

#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
  osMessageQDef(MsgBox, GUI_BOX_MESSAGES_MAX, uint32_t);
  osThreadDef(GUI, TaskGUI, FREERTOS_GUI_PRIORITY, 0, FREERTOS_GUI_STACK_SIZE);
  GUIMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  if(NULL == osThreadCreate(osThread(GUI), &GUIMsgBox))
#else
  GUIMsgBox = osMessageQueueNew (GUI_BOX_MESSAGES_MAX, sizeof(uint32_t), NULL);
  if (NULL == osThreadNew(TaskGUI, &GUIMsgBox, &GUI_Thread_Atrr))
#endif /* osCMSIS < 0x20000U */
  {
    _status = USBPD_DISABLE;
  }
  /* Enable IRQ which has been disabled by FreeRTOS services */
  __enable_irq();
#else
  GUI_Start();
#endif /* _RTOS */

  return _status;
}


void GUI_Start(void)
{
  /* register the GUI callback to manage UART reception */
  TRACER_EMB_StartRX(GUI_CALLBACK_RX);
}

/**
  * @brief  GUI Task
  * @param  pEvent  GUI User event
  * @retval None
  */
#ifdef _RTOS
#if (osCMSIS < 0x20000U)
static void TaskGUI(void const *pEvent)
#else
static void TaskGUI(void *pEvent)
#endif /* osCMSIS < 0x20000U */
#else
void GUI_Execute(void)
#endif /* _RTOS */
{
#ifdef _RTOS
  uint32_t _timing = osWaitForever;
  osMessageQId  queue = *(osMessageQId *)pEvent;

  GUI_Start();
  do
  {
#if (osCMSIS < 0x20000U)
    osEvent event = osMessageGet(queue, _timing);
    switch (((GUI_USER_EVENT)event.value.v & 0xF))
#else
    uint32_t event;
    (void)osMessageQueueGet(queue, &event, NULL, _timing);
    switch (((GUI_USER_EVENT)event & 0xF))
#endif /* osCMSIS < 0x20000U */
    {
    case GUI_USER_EVENT_GUI:
      {
#if (osCMSIS < 0x20000U)
        GUI_RXProcess((uint32_t)event.value.v);
#else
        GUI_RXProcess((uint32_t)event);
#endif /* osCMSIS < 0x20000U */
        /* Sent an event to check if measurement report has been requested */
#if (osCMSIS < 0x20000U)
        osMessagePut(GUIMsgBox, GUI_USER_EVENT_TIMER, 0);
#else
        uint32_t event = GUI_USER_EVENT_TIMER;
        (void)osMessageQueuePut(GUIMsgBox, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
        break;
      }
    case GUI_USER_EVENT_TIMER:
      {
#endif /* _RTOS */
#ifndef _RTOS
      switch (GUI_Flag & 0xF)
      {
        case GUI_USER_EVENT_NONE:
          break;
        case GUI_USER_EVENT_GUI:
          GUI_RXProcess(GUI_Flag);
        case GUI_USER_EVENT_TIMER:
            break;
          default:
            break;
      }
      GUI_Flag = GUI_USER_EVENT_NONE;
#endif /* !_RTOS */
      for(uint8_t _instance = 0; _instance < USBPD_PORT_COUNT; _instance++)
      {
        /* -------------------------------------------------  */
        /* Check if timeout related to Measurement reporting  */
        /* -------------------------------------------------  */
        /* - Send a GUI Event only if PE is connected
           and Measurement report has been enabled          */
        if ((USBPD_TRUE == DPM_Params[_instance].PE_IsConnected)
            && (1 == GUI_USER_Params[_instance].u.d.MeasReportActivation)
              && (0 != GUI_USER_Params[_instance].u.d.MeasReportValue))
        {
          /* Check if timer has expired */
          if (IS_GUI_TIMER_EXPIRED(_instance, GUI_TimerMeasReport))
          {
            uint32_t event_mr = GUI_USER_EVENT_GUI | (_instance << GUI_PE_PORT_NUM_Pos) | (GUI_NOTIF_MEASUREMENT << GUI_PE_NOTIF_Pos);
            GUI_RXProcess(event_mr);
          }
          /* Start or Restart Measurement report timer */
          if (!(IS_GUI_TIMER_RUNNING(_instance, GUI_TimerMeasReport)))
          {
            GUI_START_TIMER(_instance, GUI_TimerMeasReport, (GUI_USER_Params[_instance].u.d.MeasReportValue * GUI_NOTIF_MEASUREMENT_STEP));
          }
        }
        else
        {
          /* Stop measurement report timer */
          GUI_TimerMeasReport[_instance] = 0;
        }
      }
#ifdef _RTOS
      break;
    }

    default:
      break;
    }
    _timing = CheckGUITimers();
  }
  while(1);
#endif /* !_RTOS */
}

#ifdef _RTOS
static uint32_t CheckGUITimers(void)
{
  uint32_t _timing = osWaitForever;
  uint32_t _current_timing;

  /* Calculate the minimum timers to wake-up GUI task */
  for(uint8_t instance = 0; instance < USBPD_PORT_COUNT; instance++)
  {
    /* Check if Measurement reporting has been enabled by the GUI */
    _current_timing = GUI_TimerMeasReport[instance] & GUI_TIMER_READ_MSK;
    if(_current_timing > 0)
    {
      if (_current_timing < _timing)
      {
        _timing = _current_timing;
      }
    }
  }
  return _timing;
}
#endif /* !_RTOS */

void GUI_TimerCounter(void)
{
  /* Increment GUI timer only if Measurement report has been activated */
  if (1 == GUI_USER_Params[USBPD_PORT_0].u.d.MeasReportActivation)
  {
    if((GUI_TimerMeasReport[USBPD_PORT_0] & GUI_TIMER_READ_MSK) > 0)
    {
      GUI_TimerMeasReport[USBPD_PORT_0]--;
    }
  }
#if USBPD_PORT_COUNT==2
  if (1 == GUI_USER_Params[USBPD_PORT_1].u.d.MeasReportActivation)
  {
    if((GUI_TimerMeasReport[USBPD_PORT_1] & GUI_TIMER_READ_MSK) > 0)
    {
      GUI_TimerMeasReport[USBPD_PORT_1]--;
    }
  }
#endif /* USBPD_PORT_COUNT == 2 */
}

/**
  * @brief  callback called to end a transfert.
  * @param  Character Byte received by the device
  * @param  Error     Error detected in the reception
  * @retval 1 if message to send to DPM application
  */
void GUI_CALLBACK_RX(uint8_t Character, uint8_t Error)
{
  uint32_t event;
  __disable_irq();
  event = GUI_GetMessage(Character, Error);
  __enable_irq();
  if (event == 1)
  {
#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(GUIMsgBox, GUI_USER_EVENT_GUI, 1);
#else
    uint32_t event = GUI_USER_EVENT_GUI;
    (void)osMessageQueuePut(GUIMsgBox, &event, 0U, 0U);
#endif /* osCMSIS < 0x20000U */
#else
    GUI_Flag = GUI_USER_EVENT_GUI;
#endif /* _RTOS */
  }
}

/**
  * @brief  Main Trace RX process to push data on the media.
  * @param  Event     GUI trace event
  * @retval Timing
  */
uint32_t GUI_RXProcess(uint32_t Event)
{
  uint8_t *msg;
  USBPD_GUI_State state;
  uint8_t size;

  if (0 == (Event & GUI_PE_NOTIF_Msk))
  {
    /* Message have been received by GUI */
    state = GUI_SendAnswer(&msg, &size);

    switch (state)
    {
    case GUI_STATE_RESET:
      /* DPM_RESET_REQ received by the device */
      /* Save parameters in FLASH */
      BSP_GUI_SaveDataInFlash();
      HAL_NVIC_SystemReset();
      break;
    case GUI_STATE_INIT:
      /* DPM_INIT_REQ received by the device */
      break;
    default:
      /* Another GUI messages received by the device */
      TRACER_EMB_Add(msg, size);
      break;
    }
  }
  else
  {
    uint16_t type_event = (Event & GUI_PE_NOTIF_Msk) >> GUI_PE_NOTIF_Pos;
    if (GUI_NOTIF_MEASUREMENT == type_event)
    {
      /* Notification related to timeout for measure reporting */
      /* Send a notification to associated port */
      GUI_FormatAndSendNotification(((Event & GUI_PE_PORT_NUM_Msk) >> GUI_PE_PORT_NUM_Pos), GUI_NOTIF_MEASUREREPORTING, HAL_GetTick());
    }
    else
    {
      /* Message have been received by PE */
      /* Send a notification to associated port */
      GUI_FormatAndSendNotification(((Event & GUI_PE_PORT_NUM_Msk) >> GUI_PE_PORT_NUM_Pos), GUI_NOTIF_PE_EVENT, type_event);
    }
  }

