STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
  return 0;
}

/**
  * @brief  TRACE function to send a notification
  * @param  PortNum           Index of current used port
  * @param  TypeNotification  Type of requested notification is a combination of @ref USBPD_TRACE_TRACE_TYPE_NOTIFICATION
  * @param  Value             Value depending of TypeNotification
  * @note   If TypeNotification == GUI_NOTIF_ISCONNECTED, Value should be equal to 0 (Not connected) or 1 (connected)
  * @retval USBPD Status
  */
uint32_t GUI_FormatAndSendNotification(uint32_t PortNum, uint32_t TypeNotification, uint32_t Value)
{
  uint8_t *msg;
  uint8_t size;
  /* Only send notification if GUI is connected */
  if (GUI_STATE_INIT != GUI_SendNotification(PortNum, &msg, &size, TypeNotification, Value))
  {
    TRACER_EMB_Add(msg, size);
  }
  return 0;
}


/**
  * @brief  Function called through UART IT RX to fill the GUI RX buffer
  * @param  Character Received byte
  * @param  Error     Error if issue during reception
  * @retval 1 indicates that a complete GUI message have been received
  */
uint32_t GUI_GetMessage(uint8_t Character, uint8_t Error)
{
  uint32_t status = 0;
  static uint16_t counter = 0;    /* Allows for example to count the number of SOF or EOF we received consecutively */
  static uint16_t cursor = 0;     /* Our position in the buffer */
  static uint16_t currentSize;    /* How many bytes we should expect */
  static enum receptionStateMachine
  {
    Rstart,
    RonGoing,
    Rsize,
    Rend,
    Rerror
  } Rstate = Rstart;

  if(cursor < TLV_SIZE_MAX)
  {
    PtrDataRx[cursor] = Character;
  }
  else /* buffer too small, overflow */
  {
    cursor = 0;
    counter = 0;
    Rstate = Rstart;
    return 0;
  }

  if(Error) Rstate = Rerror;

  switch(Rstate)
  {
  case Rstart :
    if(PtrDataRx[cursor] == TLV_SOF)
    {
      counter++;
    }
    else
    {
      counter = 0;
      cursor = 0xFFFF; /* cursor is unsigned, but it will inevitably increments at the end of function, and we need a 0 at the next pass here */
    }

    if(counter == 4) /* The whole SOF is received */
    {
      counter = 0;
      Rstate = Rsize;
    }
    break;
  case Rsize :
    counter++;

    if(counter == 3) /* We have received the size */
    {
      currentSize = (PtrDataRx[cursor-1] << 8) + PtrDataRx[cursor];
      if (0 == currentSize)
      {
        Rstate = Rend;
      }
      else
      {
        Rstate = RonGoing;
      }
      counter = 0;
    }
    break;
  case RonGoing :
    counter++;

    if(counter == currentSize)
    {
      /* When there is no value, the first EOF is handled by Rongoing, before Rend takes control */
      counter = 0;
      Rstate = Rend;
    }
    break;
  case Rend :
    counter++;
    if(PtrDataRx[cursor] == TLV_EOF
       && PtrDataRx[cursor-1] == TLV_EOF
         && PtrDataRx[cursor-2] == TLV_EOF
           && PtrDataRx[cursor-3] == TLV_EOF)
    {
      /* The semaphore must be given only in this case, because otherwise it means we didn't receive the correct size of bytes */
      if(counter == 4)
      {
        status = 1;
      }
      counter = 0;
      cursor = 0xFFFF;
      Rstate = Rstart;
    }

    if(cursor == currentSize + 11)
    {
      /* No complete EOF arrived. We reset the buffer for safety even if the instruction might be complete. */
      counter = 0;
      cursor = 0xFFFF;
      Rstate = Rstart;
    }
    break;
  case Rerror :
    counter = 0;
    cursor = 0xFFFF;
    Rstate = Rstart;
    break;
  }

  cursor++;
  return status;
}

/**
  * @brief  Answer to a message received by the GUI
  * @param  pMsgToSend Pointer on the message to send
  * @param  pSizeMsg   Pointer on the size of the message to send
  * @retval GUI state
  */
USBPD_GUI_State GUI_SendAnswer(uint8_t **pMsgToSend, uint8_t *pSizeMsg)
{
  /* Extract the port from the tag*/
  uint8_t port = PtrDataRx[TLV_TAG_POSITION] >> GUI_PORT_BIT_POSITION;

  /* Do the appropriate treatment in response to what we have received */
  switch(PtrDataRx[TLV_TAG_POSITION] & 0x1F)
  {
  case DPM_RESET_REQ:
    /* Reset*/
    return GUI_STATE_RESET;

  case DPM_INIT_REQ:
    {
      Send_DpmInitCnf(port, Processed);
      *pMsgToSend = Processed;
      *pSizeMsg = TLV_get_string_length(Processed) + 8;
      TRACER_EMB_Add(*pMsgToSend, *pSizeMsg);
      GUI_State = GUI_STATE_RUNNING;
      if (0 == port)
      {
        /* Send a notification all the port */
        GUI_FormatAndSendNotification(USBPD_PORT_0, GUI_NOTIF_ISCONNECTED | GUI_NOTIF_PE_EVENT | GUI_NOTIF_TIMESTAMP, USBPD_NOTIFY_ALL);
#if USBPD_PORT_COUNT==2
        GUI_FormatAndSendNotification(USBPD_PORT_1, GUI_NOTIF_ISCONNECTED | GUI_NOTIF_PE_EVENT | GUI_NOTIF_TIMESTAMP, USBPD_NOTIFY_ALL);
#endif /* USBPD_PORT_COUNT == 2 */
      }
      return GUI_STATE_INIT;
    }

  case DPM_CONFIG_GET_REQ:
    if (0 != port)
    {
      Send_DpmConfigGetCnf((port - 1), PtrDataRx, Processed);
    }
    else
    {
      Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
    }
    break;
  case DPM_CONFIG_SET_REQ:
    if (0 != port)
    {
      Send_DpmConfigSetCnf((port - 1), PtrDataRx, Processed);
    }
    else
    {
      Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
    }
    break;
  case DPM_MESSAGE_REQ:
    if (0 != port)
    {
      Request_MessageReq((port - 1), PtrDataRx, Processed);
    }
    else
    {
      Send_DpmMessageRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
    }
    break;
  case DPM_REGISTER_READ_REQ:
    if (0 != port)
    {
      /* If size is 0*/
      if(!PtrDataRx[TLV_LENGTH_HIGH_POSITION] && !PtrDataRx[TLV_LENGTH_LOW_POSITION])
      {
        Send_DpmRegisterReadCnf((port - 1), Processed, 0xFF);
      }
      else
      {
        /* PtrDataRx[TLV_VALUE_POSITION] is the tag in parameter,
           when only one parameter is needed (cf USBPD GUI specification)*/
        Send_DpmRegisterReadCnf((port - 1), Processed, PtrDataRx[TLV_VALUE_POSITION]);
      }
    }
    else
    {
      Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
    }
    break;
  case DPM_REGISTER_WRITE_REQ:
    if (0 != port)
    {
      Send_DpmRegisterWriteCnf((port - 1), Processed, PtrDataRx);
    }
    else
    {
      Send_DpmConfigGetRej(port, Processed, GUI_REJ_DPM_INVALID_PORT_NUMBER);
    }
    break;
  default :
    break;
  }

