STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
  case USBPD_CORE_GET_BATTERY_STATUS:
    {
      GUI_SaveInformation[PortNum].GetBatteryStatus.BatteryStatusRef = *(uint8_t*)Ptr;
    }
    break;

  case USBPD_CORE_GET_BATTERY_CAPABILITY:
    {
      uint8_t* temp = (uint8_t*)Ptr;
      GUI_SaveInformation[PortNum].GetBatteryCapability.BatteryCapRef= *temp;
    }
    break;
#endif /* _BATTERY */
#if _ALERT
    case USBPD_CORE_ALERT:
      {
        uint8_t*  alert;
        alert = (uint8_t*)&GUI_SaveInformation[PortNum].RcvAlert.d32;
        memcpy(alert, Ptr, Size);
      }
      break;
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
#if defined(_VCONN_SUPPORT)
    case GUI_VDM_CABLE_INFO:
      {
        uint8_t*  disco_ident;
        disco_ident = (uint8_t*)&GUI_SaveInformation[PortNum].VDM_DiscoCableIdentify;
        memcpy(disco_ident, Ptr, Size);
      }
      break;
#endif /* _VCONN_SUPPORT */

  /* In case of unexpected data type (Set request could not be fulfilled) :
   */
  default :
    break;
  }
}


/**
  * @}
  */

/** @defgroup USBPD_GUI_API_Private_Functions GUI API Private Functions
  * @{
  */
/**
  * @brief  Send DPM_INIT_CNF message to GUI
  * @param  PortNum   Port number
  * @param  pEncodedMsg Pointer on the message to be encoded
  * @retval None
  */
static void Send_DpmInitCnf(uint8_t PortNum, uint8_t *pEncodedMsg)
{
  TLV_ToSend_Data ToSendTLV;
  TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID(PortNum, DPM_INIT_CNF), TLV_SIZE_MAX, pEncodedMsg);

  /* Information by board */
  if (0 == PortNum)
  {
    /* HWBoardVersion */
    const uint8_t* hwversion;
    if (NULL != pCB_HWBoardVersion)
    {
      hwversion = pCB_HWBoardVersion();
    }
    else
    {
      hwversion = (uint8_t*) "UNKNOWN";
    }
    TLV_add(&ToSendTLV, GUI_INIT_HWBOARDVERSION, strlen((const char*)hwversion), hwversion);

    /* HWPDType */
    const uint8_t* hwpdtype;
    if (NULL != pCB_HWBoardVersion)
    {
      hwpdtype  = pCB_HWPDType();
    }
    else
    {
      hwpdtype = (uint8_t*) "UNKNOWN";
    }
    TLV_add(&ToSendTLV, GUI_INIT_HWPDTYPE, strlen((const char*)hwpdtype), hwpdtype);

    /* NbPortMax */
    TLV_add(&ToSendTLV, GUI_INIT_NBPORTMAX, 1, (uint8_t[]){USBPD_PORT_COUNT});
    /* FW Version */
    TLV_add(&ToSendTLV, GUI_INIT_FWVERSION, 8, (uint8_t[]){
      (USBPD_FW_VERSION & 0x000000FF),
        (USBPD_FW_VERSION & 0x0000FF00) >> 8,
          (USBPD_FW_VERSION & 0x00FF0000) >> 16,
            (USBPD_FW_VERSION & 0xFF000000) >> 24,
      (_LIB_ID & 0x000000FF),
        (_LIB_ID & 0x0000FF00) >> 8,
          (_LIB_ID & 0x00FF0000) >> 16,
            (_LIB_ID & 0xFF000000) >> 24}
    );
    /* Start Port number */
    TLV_add(&ToSendTLV, GUI_INIT_NB_PORT_START, 1, (uint8_t[]){USBPD_START_PORT_NUMBER});
    /* Start Port number */
    TLV_add(&ToSendTLV, GUI_INIT_NB_PORT_START, 1, (uint8_t[]){USBPD_START_PORT_NUMBER});

    /* Original settings */
    TLV_add(&ToSendTLV, GUI_INIT_ORIGINAL_SETTINGS, 1, (uint8_t*)&GUI_OriginalSettings);

    TLV_deinit_encode(&ToSendTLV);
  }
  else
  {
    uint16_t settings;
    uint8_t port = PortNum - 1;
#if defined(MB1303)
    uint16_t fake = 0xADDE;
#endif /*MB1303*/
    /* TypeCSpecVersion & PDSpecRevision */
    settings = DPM_Settings[port].PE_SpecRevision;
    TLV_add(&ToSendTLV, GUI_INIT_TYPECSPECREVISION, 2, (uint8_t[]){0x12, settings});
#if defined(USBPD_REV30_SUPPORT)
    /* Extended Messages UnCkunked */
    settings = DPM_Settings[port].PE_PD3_Support.d.PE_UnchunkSupport;
    TLV_add(&ToSendTLV, GUI_INIT_EXTENDEDMESSAGESUNCKUNKED, 1, (uint8_t*)&settings);
#endif /* USBPD_REV30_SUPPORT */
    /* AccessorySupp */
    settings = DPM_Settings[port].CAD_AccesorySupport;
    TLV_add(&ToSendTLV, GUI_INIT_ACCESSORYSUPP, 1, (uint8_t*)&settings);
    /*PowerAccessoryDetection*/
    settings = DPM_USER_Settings[port].PWR_AccessoryDetection;
    TLV_add(&ToSendTLV, GUI_INIT_POWERACCESSORYDETECTION, 1, (uint8_t*)&settings);
    /*PowerAccessoryTransition*/
    settings = DPM_USER_Settings[port].PWR_AccessoryTransition;
    TLV_add(&ToSendTLV, GUI_INIT_POWERACCESSORYTRANSITION, 1, (uint8_t*)&settings);
    /*IsCable*/
    TLV_add(&ToSendTLV, GUI_INIT_ISCABLE, 1, (uint8_t[]){0x00});
    /*TryFeature*/
    settings = DPM_Settings[port].CAD_TryFeature;
    TLV_add(&ToSendTLV, GUI_INIT_TRYFEATURE, 1, (uint8_t*)&settings);
    /*RpResistorValue*/
    settings = DPM_USER_Settings[port].PWR_RpResistorValue;
    TLV_add(&ToSendTLV, GUI_INIT_RPRESISTORVALUE, 1, (uint8_t*)&settings);
    /*USBSupport*/
    settings = DPM_USER_Settings[port].USB_Support;
    TLV_add(&ToSendTLV, GUI_INIT_USBSUPPORT, 1, (uint8_t*)&settings);
    /*USBDevice*/
    settings = DPM_USER_Settings[port].USB_Device;
    TLV_add(&ToSendTLV, GUI_INIT_USBDEVICE, 1, (uint8_t*)&settings);
    /*USBHost*/
    settings = DPM_USER_Settings[port].USB_Host;
    TLV_add(&ToSendTLV, GUI_INIT_USBHOST, 1, (uint8_t*)&settings);
    /*Externally_Powered*/
    settings = DPM_USER_Settings[port].PWR_UnconstrainedPower;
    TLV_add(&ToSendTLV, GUI_INIT_UNCONSTRAINED_POWERED, 1, (uint8_t*)&settings);
    /*USBSuspendSupport*/
    settings = DPM_USER_Settings[port].USB_SuspendSupport;
    TLV_add(&ToSendTLV, GUI_INIT_USBSUSPENDSUPPORT, 1, (uint8_t*)&settings);
#if defined(MB1303)
    /*VConnDischarge*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNDISCHARGE, 2, (uint8_t*)&fake);
    /*VConnLim*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNILIM, 2, (uint8_t*)&fake);
    /*VConnLimValue*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNILIMVALUE, 2, (uint8_t*)&fake);
    /*VConnMonitoring*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNMONITORING, 2, (uint8_t*)&fake);
    /*VConnThresholdUVLO*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNTHRESHOLDUVLO, 2, (uint8_t*)&fake);
    /*VConnSupply*/
    TLV_add(&ToSendTLV, GUI_INIT_VCONNSUPPLY, 2, (uint8_t*)&fake);
#endif /*MB1303*/

    TLV_deinit_encode(&ToSendTLV);
  }
}

/**
  * @brief      Execution of the message received
  * @note       Generation of a TLV instruction to send in the context of DPM_MESSAGE
  */
static void Request_MessageReq(uint8_t PortNum, uint8_t* instruction, uint8_t *pEncodedMsg)
{
  USBPD_StatusTypeDef status = USBPD_ERROR;
  TLV_Received_Data process_tlv;
  TLV_ToSend_Data send_tlv;

  TLV_init_decode(&process_tlv, instruction);
  TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_MESSAGE_CNF), TLV_SIZE_MAX, pEncodedMsg);

