STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
  /*
    In case there is an error, we use this variable to know when to send a DPM_MESSAGE_REJ
    instead of a DPM_MESSAGE_CNF. This variable contains the cause if there is one.
  */
  USBPD_GUI_Reject_Reason error = GUI_REJ_DPM_REJECT;

  uint8_t tag;
  uint16_t length;
  uint8_t *value;
  TLV_get(&process_tlv, &tag, &length, &value);
  switch(tag)
    /*
      Each case should:
      - Apply his specific request in the stack. If parameters are needed, they can be found in the value pointer
      - If there is an error, set the error variable according to it (cf USBPD_GUI_Specification)
      - Otherwise in case of success, do nothing else
    */
  {
  case GUI_MSG_GOTOMIN :
    status = USBPD_DPM_RequestGotoMin(PortNum);
    break;
  case GUI_MSG_PING :
    status = USBPD_DPM_RequestPing(PortNum);
    break;
  case GUI_MSG_GET_SRC_CAPA :
    status = USBPD_DPM_RequestGetSourceCapability(PortNum);
    break;
  case GUI_MSG_GET_SNK_CAPA :
    status = USBPD_DPM_RequestGetSinkCapability(PortNum);
    break;
  case GUI_MSG_DR_SWAP :
    status = USBPD_DPM_RequestDataRoleSwap(PortNum);
    break;
  case GUI_MSG_PR_SWAP :
    status = USBPD_DPM_RequestPowerRoleSwap(PortNum);
    break;
  case GUI_MSG_VCONN_SWAP :
    status = USBPD_DPM_RequestVconnSwap(PortNum);
    break;
  case GUI_MSG_SOURCE_CAPA :
    status = USBPD_DPM_RequestSourceCapability(PortNum);
    break;
  case GUI_MSG_REQUEST :
    {
      uint16_t voltage = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t index_pdo = 0;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 2))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_RDOPOSITION == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          index_pdo = value[0];
        }
        else if (GUI_PARAM_MSG_REQUESTEDVOLTAGE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          voltage = LE16(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (2 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestMessageRequest(PortNum, index_pdo, voltage);
      }
    }
    break;
  case GUI_MSG_SOFT_RESET :
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      status = USBPD_DPM_RequestSoftReset(PortNum, (USBPD_SOPType_TypeDef)value[0]);
    }
    break;
  case GUI_MSG_HARD_RESET :
    status = USBPD_DPM_RequestHardReset(PortNum);
    break;
  case GUI_MSG_CABLE_RESET :
    status = USBPD_DPM_RequestCableReset(PortNum);
    break;
#if defined(_VDM) || defined(_VCONN_SUPPORT)
  case GUI_MSG_VDM_DISCO_IDENT :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      status = USBPD_DPM_RequestVDM_DiscoveryIdentify(PortNum, (USBPD_SOPType_TypeDef)value[0]);
    }
    break;
  case GUI_MSG_VDM_DISCO_SVID :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      status = USBPD_DPM_RequestVDM_DiscoverySVID(PortNum, (USBPD_SOPType_TypeDef)value[0]);
    }
    break;
  case GUI_MSG_VDM_DISCO_MODE :
    {
      uint16_t svid = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 2))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (2 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestVDM_DiscoveryMode(PortNum, (USBPD_SOPType_TypeDef)sop, svid);
      }
    }
    break;
  case GUI_MSG_VDM_ENTER_MODE :
    {
      uint16_t mode = 0, svid = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 3))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        else if (GUI_PARAM_MSG_SVDM_MODEINDEX == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          mode = LE16(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (3 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestVDM_EnterMode(PortNum, (USBPD_SOPType_TypeDef)sop, svid, mode);
      }
    }
    break;
  case GUI_MSG_VDM_EXIT_MODE :
    {
      uint16_t svid = 0, mode = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 3))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        else if (GUI_PARAM_MSG_SVDM_MODEINDEX == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          mode = value[0];
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (3 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestVDM_ExitMode(PortNum, (USBPD_SOPType_TypeDef)sop, svid, mode);
      }
    }
    break;
  case GUI_MSG_VDM_UNSTRUCTURED :
    break;
  case GUI_MSG_DISPLAY_PORT_STATUS :
    {
      uint32_t dp_status;
      uint16_t svid = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 3))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        else if (GUI_PARAM_MSG_DP_STATUS == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          dp_status = LE32(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (3 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestDisplayPortStatus(PortNum, (USBPD_SOPType_TypeDef)sop, svid, &dp_status);
      }
    }
    break;
  case GUI_MSG_DISPLAY_PORT_CONFIG :
    {
      uint32_t dp_config;
      uint16_t svid = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 3))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        else if (GUI_PARAM_MSG_DP_CONFIGURE== (USBPD_GUI_Tag_ParamMsg)tag)
        {
          dp_config = LE32(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (3 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestDisplayPortConfig(PortNum, (USBPD_SOPType_TypeDef)sop, svid, &dp_config);
      }
    }
    break;
  case GUI_MSG_DISPLAY_PORT_ATTENTION :
    break;
#endif /* _VDM || _VCONN_SUPPORT */
#if defined(_VDM)
  case GUI_MSG_VDM_ATTENTION :
    {
      uint16_t svid = 0;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 2))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_SVDM_SVID == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          svid = LE16(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (2 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestAttention(PortNum, (USBPD_SOPType_TypeDef)sop, svid);
      }
    }
    break;
#endif /* _VDM */
  case GUI_MSG_FREE_TEXT :
    {
      uint8_t nb_expected_tag = 0;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 1))
      {
        nb_expected_tag++;
      }
      if (1 == nb_expected_tag)
      {
        status = Manage_FreeText(PortNum, value, length);
      }
    }
    break;
#ifdef USBPD_REV30_SUPPORT
  case GUI_MSG_FR_SWAP :
    status = USBPD_DPM_RequestFastRoleSwap(PortNum);
    break;
  case GUI_MSG_GET_PPS_STATUS :
    status = USBPD_DPM_RequestGetPPS_Status(PortNum);
    break;
  case GUI_MSG_GET_COUNTRY_CODES :
    status = USBPD_DPM_RequestGetCountryCodes(PortNum);
    break;
  case GUI_MSG_GET_STATUS :
    status = USBPD_DPM_RequestGetStatus(PortNum);
    break;
  case GUI_MSG_GET_SOURCE_CAPA_EXTENDED :
    status = USBPD_DPM_RequestGetSourceCapabilityExt(PortNum);
    break;
  case GUI_MSG_GET_SINK_CAPA_EXTENDED :
    status = USBPD_DPM_RequestGetSinkCapabilityExt(PortNum);
    break;
  case GUI_MSG_ALERT :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_ALERTMSG == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      USBPD_ADO_TypeDef alert;
      alert.d32 = LE32(&value[0]);
      status = USBPD_DPM_RequestAlert(PortNum, alert);
    }
    break;
  case GUI_MSG_GET_COUNTRY_INFO :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_COUNTRYCODE == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      uint16_t country_code;
      country_code = LE16(&value[0]);
      status = USBPD_DPM_RequestGetCountryInfo(PortNum, country_code);
    }
    break;
  case GUI_MSG_GET_BAT_CAPA :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_BATTERYREF == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      status = USBPD_DPM_RequestGetBatteryCapability(PortNum, (uint8_t*)&value[0]);
    }
    break;
  case GUI_MSG_GET_BAT_STATUS :
    if (length > TLV_SIZE_MAX) break;
    TLV_get(&process_tlv, &tag, &length, &value);
    if (GUI_PARAM_MSG_BATTERYREF == (USBPD_GUI_Tag_ParamMsg)tag)
    {
      status = USBPD_DPM_RequestGetBatteryStatus(PortNum, (uint8_t*)&value[0]);
    }
    break;
  case GUI_MSG_GET_MANU_INFO :
    {
      uint16_t manu_info;
      uint8_t nb_expected_tag = 0;
      uint8_t sop = USBPD_SOPTYPE_SOP;
      if (length > TLV_SIZE_MAX) break;
      TLV_get(&process_tlv, &tag, &length, &value);
      while((0 != length) && (TLV_SIZE_MAX > length) && (nb_expected_tag < 2))
      {
        nb_expected_tag++;
        if (GUI_PARAM_MSG_SOPTYPE == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          sop = value[0];
        }
        else if (GUI_PARAM_MSG_MANUINFODATA == (USBPD_GUI_Tag_ParamMsg)tag)
        {
          manu_info = LE16(&value[0]);
        }
        TLV_get(&process_tlv, &tag, &length, &value);
      }
      if (2 == nb_expected_tag)
      {
        status = USBPD_DPM_RequestGetManufacturerInfo(PortNum, (USBPD_SOPType_TypeDef)sop, (uint8_t*)&manu_info);
      }
    }
    break;
  case GUI_MSG_SECU_REQUEST :
    status = USBPD_DPM_RequestSecurityRequest(PortNum);
    break;
  case GUI_MSG_FIRM_UPDATE_REQUEST :
    break;
#endif /* USBPD_REV30_SUPPORT */
  default :
    break;
  }

