STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
  /* Updtate CAD_SNKToggleTime & CAD_SRCToggleTime only if TDRP and/or DC_SRC_DRP have been received */
  if (1 == flag_drp)
  {
    uint16_t calcul;
    if (0 == tdrp)
    {
      tdrp = DPM_Settings[PortNum].CAD_SNKToggleTime + DPM_Settings[PortNum].CAD_SRCToggleTime;
    }
    if (0 == dcdrp)
    {
      dcdrp = (DPM_Settings[PortNum].CAD_SRCToggleTime * 100) / (DPM_Settings[PortNum].CAD_SNKToggleTime + DPM_Settings[PortNum].CAD_SRCToggleTime);
    }
    calcul = (tdrp * dcdrp) / 100;
    DPM_Settings[PortNum].CAD_SRCToggleTime = (uint8_t)calcul;
    calcul = tdrp * (100 - dcdrp) / 100;
    DPM_Settings[PortNum].CAD_SNKToggleTime = (uint8_t)calcul;
  }

  /* Only applies if an error was specified. Will send a DPM_CONFIG_REJ instead of DPM_CONFIG_SET_CNF*/
  if(error != 0xFF)
  {
    TLV_deinit_encode(&send_tlv);
    TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_CONFIG_REJ), TLV_SIZE_MAX, pEncodedMsg);
    TLV_addValue(&send_tlv, &error, 1);

    /* If the cause of error is DPM_REJECT, we have to list the tag of parameters which didn't pass */
    if(!error)
    {
      uint32_t index;
      for(index = 0; index < counter_param_not_applicated; index++)
      {
        TLV_addValue(&send_tlv, &param_not_applicated[index], 1);
      }
    }
    TLV_deinit_encode(&send_tlv);
  }
}

static void Send_DpmConfigGetCnf(uint8_t PortNum, uint8_t* instruction, uint8_t *pEncodedMsg)
{
  TLV_ToSend_Data send_tlv;
  TLV_init_encode(&send_tlv, __GUI_SET_TAG_ID((PortNum + 1), DPM_CONFIG_GET_CNF), TLV_SIZE_MAX, pEncodedMsg);
  uint16_t length = TLV_get_string_length(instruction) - TLV_HEADER_SIZE;
  uint8_t index = 0;
  uint8_t param;

  /* This is a state machine. */
  do
  {
    /* If there is no parameters, we go through each case of the state machine in one pass. (conditionnal breaks) */
    if(0 == length)
    {
      param = GUI_PARAM_ALL;
    }
    else
    {
      /* If there are, we loop the state machine and go through one case each time. */
      param = instruction[TLV_VALUE_POSITION + index];
    }

    /*
    Each case should simply use the TLV_add function to insert his corresponding data,
    as suggested in comment. Manual cast to (uint8_t *) may be required.
    */
    switch((USBPD_GUI_Tag_Param)param)
    {
    case GUI_PARAM_ALL :
    case GUI_PARAM_SOP :
      {
        /* SOP & SOP1 & SOP2 */
        /* SOP1_Debug & SOP2_Debug not implemented */
        uint8_t settings = DPM_Settings[PortNum].PE_SupportedSOP;
        TLV_add(&send_tlv, GUI_PARAM_SOP, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
#if defined(USBPD_REV30_SUPPORT)
    case GUI_PARAM_FASTROLESWAP :
      {
        /*FastRoleSwap*/
        uint8_t settings = DPM_Settings[PortNum].PE_PD3_Support.d.PE_FastRoleSwapSupport;
        TLV_add(&send_tlv, GUI_PARAM_FASTROLESWAP, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
#endif /*USBPD_REV30_SUPPORT*/
    case GUI_PARAM_DATAROLESWAP_TO_UFP :
      {
        /* DataRoleSwap to UFP */
        uint8_t settings = DPM_USER_Settings[PortNum].PE_DR_Swap_To_UFP;
        TLV_add(&send_tlv, GUI_PARAM_DATAROLESWAP_TO_UFP, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_DATAROLESWAP_TO_DFP :
      {
        /* DataRoleSwap to DFP */
        uint8_t settings = DPM_USER_Settings[PortNum].PE_DR_Swap_To_DFP;
        TLV_add(&send_tlv, GUI_PARAM_DATAROLESWAP_TO_DFP, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_DEFAULTPOWERROLE :
      {
        /*DefaultPowerRole*/
        uint8_t settings = DPM_Settings[PortNum].PE_DefaultRole;
        TLV_add(&send_tlv, GUI_PARAM_DEFAULTPOWERROLE, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_DRP_SUPPORT :
      {
        /*DRP_Support*/
        uint8_t settings = DPM_Settings[PortNum].PE_RoleSwap;
        TLV_add(&send_tlv, GUI_PARAM_DRP_SUPPORT, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_CADROLETOGGLE :
      {
        /*CADRoleToggle*/
        uint8_t settings = DPM_Settings[PortNum].CAD_RoleToggle;
        TLV_add(&send_tlv, GUI_PARAM_CADROLETOGGLE, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_PE_SCAP_HR :
      {
        /*PE_SCAP_HR*/
        uint8_t settings = DPM_Settings[PortNum].PE_CapscounterSupport;
        TLV_add(&send_tlv, GUI_PARAM_PE_SCAP_HR,  1, &settings);
        if(0 != length)
        {
          break;
        }
      }
    case GUI_PARAM_VCONNSWAP :
      {
        /*VConnSwap*/
        uint8_t settings = DPM_USER_Settings[PortNum].PE_VconnSwap;
        TLV_add(&send_tlv, GUI_PARAM_VCONNSWAP, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
#if defined(_VDM)
    case GUI_PARAM_VDM_SUPPORT :
      {
        /* DRP Support */
        uint8_t settings = DPM_Settings[PortNum].PE_VDMSupport;
        TLV_add(&send_tlv, GUI_PARAM_VDM_SUPPORT, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
#endif /*_VDM*/
    case GUI_PARAM_PING_SUPPORT :
      {
        /* Ping Support */
        uint8_t settings = DPM_Settings[PortNum].PE_PingSupport;
        TLV_add(&send_tlv, GUI_PARAM_PING_SUPPORT, 1, &settings);
        if(0 != length)
        {
          break;
        }
      }
#if defined(USBPD_REV30_SUPPORT)
    case GUI_PARAM_PPS_SUPPORT :
      {
        /* PD3 Support */
        uint16_t settings = DPM_Settings[PortNum].PE_PD3_Support.PD3_Support;
        TLV_add(&send_tlv, GUI_PARAM_PPS_SUPPORT, 2, (uint8_t*)&settings);
        if(0 != length)
        {
          break;
        }
      }
#endif /*USBPD_REV30_SUPPORT*/
#if defined(_SNK) || defined(_DRP)
    case GUI_PARAM_SNK_PDO :
      {
        uint8_t* list_pdo;
        uint8_t nb_pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          nb_pdo    =  USBPD_NbPDO[0];
          list_pdo  = (uint8_t*)PORT0_PDO_ListSNK;
        }
#if USBPD_PORT_COUNT==2
        else
        {
          nb_pdo    =  USBPD_NbPDO[2];
          list_pdo  = (uint8_t*)PORT1_PDO_ListSNK;
        }
#endif /* USBPD_PORT_COUNT==2 */
        TLV_add(&send_tlv, GUI_PARAM_SNK_PDO, nb_pdo * 4, list_pdo);
      }
      if(0 != length)
      {
        break;
      }
#endif /* _SNK || _DRP */
#if defined(_SRC) || defined(_DRP)
    case GUI_PARAM_SRC_PDO :
      {
        uint8_t* list_pdo;
        uint8_t nb_pdo;
#if USBPD_PORT_COUNT==2
        if (USBPD_PORT_0 == PortNum)
#endif /* USBPD_PORT_COUNT==2 */
        {
          nb_pdo    =  USBPD_NbPDO[1];
          list_pdo  = (uint8_t*)PORT0_PDO_ListSRC;
        }
#if USBPD_PORT_COUNT==2
        else
        {
          nb_pdo    =  USBPD_NbPDO[3];
          list_pdo  = (uint8_t*)PORT1_PDO_ListSRC;
        }
#endif /* USBPD_PORT_COUNT==2 */
        TLV_add(&send_tlv, GUI_PARAM_SRC_PDO, nb_pdo * 4, list_pdo);
      }
      if(0 != length)
      {
        break;
      }
#endif /* _SRC || _DRP */
    case GUI_PARAM_TDRP :
      {
        /* Calculate the current value of tDRP (value between 50ms and 100ms) */
        uint8_t value = DPM_USER_Settings[PortNum].CAD_tDRP;
        TLV_add(&send_tlv, GUI_PARAM_TDRP, 1, &value);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_DCSRC_DRP :
      {
        /* Calculate the current value of tDRP (value between 50ms and 100ms) */
        uint8_t value = DPM_USER_Settings[PortNum].CAD_dcSRC_DRP;
        TLV_add(&send_tlv, GUI_PARAM_DCSRC_DRP, 1, &value);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_RESPONDS_TO_DISCOV_SOP :
      {
        uint8_t settings = DPM_Settings[PortNum].PE_RespondsToDiscovSOP;
        TLV_add(&send_tlv, GUI_PARAM_RESPONDS_TO_DISCOV_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_ATTEMPTS_DISCOV_SOP :
      {
        uint8_t settings = DPM_Settings[PortNum].PE_AttemptsDiscovSOP;
        TLV_add(&send_tlv, GUI_PARAM_ATTEMPTS_DISCOV_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_XID_SOP :
      {
        uint32_t value = DPM_ID_Settings[PortNum].XID;
        TLV_add(&send_tlv, GUI_PARAM_XID_SOP, 4, (uint8_t*)&value);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_USB_VID_SOP :
      {
        uint16_t value = DPM_ID_Settings[PortNum].VID;
        TLV_add(&send_tlv, GUI_PARAM_USB_VID_SOP, 2, (uint8_t*)&value);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_PID_SOP :
      {
        uint16_t value = DPM_ID_Settings[PortNum].PID;
        TLV_add(&send_tlv, GUI_PARAM_PID_SOP, 2, (uint8_t*)&value);
      }
      if(0 != length)
      {
        break;
      }
#if defined(_VDM)
    case GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP :
      {
        uint8_t settings = DPM_VDM_Settings[PortNum].VDM_USBHostSupport;
        TLV_add(&send_tlv, GUI_PARAM_DATA_CAPABLE_AS_USB_HOST_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP :
      {
        uint8_t settings = DPM_VDM_Settings[PortNum].VDM_USBDeviceSupport;
        TLV_add(&send_tlv, GUI_PARAM_DATA_CAPABLE_AS_USB_DEVICE_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_PRODUCT_TYPE_SOP :
      {
        uint8_t settings = DPM_VDM_Settings[PortNum].VDM_ProductTypeUFPorCP;
        TLV_add(&send_tlv, GUI_PARAM_PRODUCT_TYPE_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP :
      {
        uint8_t settings = DPM_VDM_Settings[PortNum].VDM_ModalOperation;
        TLV_add(&send_tlv, GUI_PARAM_MODAL_OPERATION_SUPPORTED_SOP, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
    case GUI_PARAM_BCDDEVICE_SOP :
      {
        uint16_t value = DPM_VDM_Settings[PortNum].VDM_bcdDevice_SOP;
        TLV_add(&send_tlv, GUI_PARAM_BCDDEVICE_SOP, 2, (uint8_t*)&value);
      }
      if(0 != length)
      {
        break;
      }
#endif /* _VDM */
    case GUI_PARAM_MEASUREREPORTING :
      {
        uint8_t settings = GUI_USER_Params[PortNum].u.MeasurementReporting;
        TLV_add(&send_tlv, GUI_PARAM_MEASUREREPORTING, 1, &settings);
      }
      if(0 != length)
      {
        break;
      }
#if defined(USBPD_REV30_SUPPORT)
#if _MANU_INFO
    case GUI_PARAM_MANUINFOPORT_VID :
      {
        uint8_t size = sizeof(DPM_USER_Settings[PortNum].DPM_ManuInfoPort.ManuString) + 4;
        TLV_add(&send_tlv, GUI_PARAM_MANUINFOPORT_VID, size, (uint8_t*)&DPM_USER_Settings[PortNum].DPM_ManuInfoPort);
      }
      if(0 != length)
      {
        break;
      }
#endif /* _MANU_INFO */
#endif /*USBPD_REV30_SUPPORT*/
    default:
      if(0 != length)
      {
        /* At least 1 parameter does not exist */
        TLV_deinit_encode(&send_tlv);
        Send_DpmConfigGetRej(PortNum, pEncodedMsg, GUI_REJ_DPM_INVALID_MESSAGE);
        goto __end;
      }
      break;
    }
    index++;
    /*
    Loop until we haven't processed each specified parameter.
    If there weren't any (length = 0), we exit the loop after one execution.
    */
  } while(index < length);

__end:
  TLV_deinit_encode(&send_tlv);
}

