STMicroelectronics/STM32CubeG4/Utilities/GUI_INTERFACE/gui_api.c
static void Send_DpmConfigGetRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejectReason)
{
  TLV_ToSend_Data send_tlv;
  TLV_init_encode(&send_tlv, DPM_CONFIG_REJ, TLV_SIZE_MAX, pEncodedMsg);
  TLV_add(&send_tlv, RejectReason, 0, NULL);
  TLV_deinit_encode(&send_tlv);
}

static void Send_DpmMessageRej(uint8_t PortNum, uint8_t *pEncodedMsg, USBPD_GUI_Reject_Reason RejectReason)
{
  TLV_ToSend_Data send_tlv;
  TLV_init_encode(&send_tlv, DPM_MESSAGE_REJ, TLV_SIZE_MAX, pEncodedMsg);
  TLV_add(&send_tlv, RejectReason, 0, NULL);
  TLV_deinit_encode(&send_tlv);
}

static void Send_DpmRegisterReadCnf(uint8_t PortNum, uint8_t *pEncodedMsg, uint8_t param)
{
  TLV_ToSend_Data ToSendTLV;
  TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID((PortNum +1), DPM_REGISTER_READ_CNF), TLV_SIZE_MAX, pEncodedMsg);

  uint8_t stateMachineArray[GUI_REG_NUMBER_OF_REGISTERS] = {
    GUI_REG_VENDOR_ID, GUI_REG_PRODUCT_ID, GUI_REG_DEVICE_ID, GUI_REG_USBTYPEC_REV,
    GUI_REG_USBPD_REV_VER, GUI_REG_USBPD_INTERFACE_REV, GUI_REG_ALERT, GUI_REG_ALERT_MASK,
    GUI_REG_POWER_STATUS_MASK, GUI_REG_FAULT_STATUS_MASK, GUI_REG_CONFIG_STANDARD_OUTPUT,
    GUI_REG_TCPC_CONTROL, GUI_REG_ROLE_CONTROL, GUI_REG_FAULT_CONTROL, GUI_REG_POWER_CONTROL,
    GUI_REG_CC_STATUS, GUI_REG_POWER_STATUS, GUI_REG_FAULT_STATUS, GUI_REG_COMMAND, GUI_REG_DECIVE_CAP1,
    GUI_REG_DECIVE_CAP2, GUI_REG_STD_INPUT_CAP, GUI_REG_STD_OUTPUT_CAP, GUI_REG_MSG_HEADER_INFO,
    GUI_REG_RX_DETECT, GUI_REG_RX_BYTE_COUNT, GUI_REG_RX_BUFFER_FRAME_TYPE, GUI_REG_RX_HEADER,
    GUI_REG_RX_DATA, GUI_REG_TRANSMIT, GUI_REG_TX_BYTE_COUNT, GUI_REG_TX_HEADER, GUI_REG_TX_DATA,
    GUI_REG_VBUS_VOLTAGE, GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD, GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD,
    GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG, GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG, GUI_REG_VENDOR_DATA
  };
  uint8_t counter = 0;

  /*  If param is not at 0xFF, then it means we only want one parameter.
      We then have to get out of the state machine after the first state */
  if(param != 0xFF)
  {
    *stateMachineArray = param;
  }

  do
  {
    switch(stateMachineArray[counter])
      /*
        In each case, the register needs to be read. Inclusion in the TLV which
        is going to be sent has to be done with TLV_add().
      */
    {
      case GUI_REG_VENDOR_ID :

              break;
      case GUI_REG_PRODUCT_ID :

              break;
      case GUI_REG_DEVICE_ID :

              break;
      case GUI_REG_USBTYPEC_REV :

              break;
      case GUI_REG_USBPD_REV_VER :

              break;
      case GUI_REG_USBPD_INTERFACE_REV :

              break;
      case GUI_REG_ALERT :

              break;
      case GUI_REG_ALERT_MASK :

              break;
      case GUI_REG_POWER_STATUS_MASK :

              break;
      case GUI_REG_FAULT_STATUS_MASK :

              break;
      case GUI_REG_CONFIG_STANDARD_OUTPUT :

              break;
      case GUI_REG_TCPC_CONTROL :

              break;
      case GUI_REG_ROLE_CONTROL :

              break;
      case GUI_REG_FAULT_CONTROL :

              break;
      case GUI_REG_POWER_CONTROL :

              break;
      case GUI_REG_CC_STATUS :

              break;
      case GUI_REG_POWER_STATUS :

              break;
      case GUI_REG_FAULT_STATUS :

              break;
      case GUI_REG_COMMAND :

              break;
      case GUI_REG_DECIVE_CAP1 :

              break;
      case GUI_REG_DECIVE_CAP2 :

              break;
      case GUI_REG_STD_INPUT_CAP :

              break;
      case GUI_REG_STD_OUTPUT_CAP :

              break;
      case GUI_REG_MSG_HEADER_INFO :

              break;
      case GUI_REG_RX_DETECT :

              break;
      case GUI_REG_RX_BYTE_COUNT :

              break;
      case GUI_REG_RX_BUFFER_FRAME_TYPE :

              break;
      case GUI_REG_RX_HEADER :

              break;
      case GUI_REG_RX_DATA :

              break;
      case GUI_REG_TRANSMIT :

              break;
      case GUI_REG_TX_BYTE_COUNT :

              break;
      case GUI_REG_TX_HEADER :

              break;
      case GUI_REG_TX_DATA :

              break;
      case GUI_REG_VBUS_VOLTAGE :

              break;
      case GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD :

              break;
      case GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD :

              break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG :

              break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG :

              break;
      case GUI_REG_VENDOR_DATA :

              break;
      default :
              break;
    }
    counter++;
  } while(counter < GUI_REG_NUMBER_OF_REGISTERS && param != 0xFF);

  TLV_deinit_encode(&ToSendTLV);
}

static void Send_DpmRegisterWriteCnf(uint8_t PortNum, uint8_t *pEncodedMsg, uint8_t *toProcess)
{
  TLV_Received_Data ToProcessTLV;
  TLV_init_decode(&ToProcessTLV, toProcess);

  uint8_t registerName;
  uint16_t registerSize;
  uint8_t *registerValue;

  TLV_get(&ToProcessTLV, &registerName, &registerSize, &registerValue);

  switch(registerName)
    /*
      Each case should write the data pointed by registerValue in the appropriate register,
      while taking into account the size of the data with registerSize.
    */
  {
      case GUI_REG_VENDOR_ID :

              break;
      case GUI_REG_PRODUCT_ID :

              break;
      case GUI_REG_DEVICE_ID :

              break;
      case GUI_REG_USBTYPEC_REV :

              break;
      case GUI_REG_USBPD_REV_VER :

              break;
      case GUI_REG_USBPD_INTERFACE_REV :

              break;
      case GUI_REG_ALERT :

              break;
      case GUI_REG_ALERT_MASK :

              break;
      case GUI_REG_POWER_STATUS_MASK :

              break;
      case GUI_REG_FAULT_STATUS_MASK :

              break;
      case GUI_REG_CONFIG_STANDARD_OUTPUT :

              break;
      case GUI_REG_TCPC_CONTROL :

              break;
      case GUI_REG_ROLE_CONTROL :

              break;
      case GUI_REG_FAULT_CONTROL :

              break;
      case GUI_REG_POWER_CONTROL :

              break;
      case GUI_REG_CC_STATUS :

              break;
      case GUI_REG_POWER_STATUS :

              break;
      case GUI_REG_FAULT_STATUS :

              break;
      case GUI_REG_COMMAND :

              break;
      case GUI_REG_DECIVE_CAP1 :

              break;
      case GUI_REG_DECIVE_CAP2 :

              break;
      case GUI_REG_STD_INPUT_CAP :

              break;
      case GUI_REG_STD_OUTPUT_CAP :

              break;
      case GUI_REG_MSG_HEADER_INFO :

              break;
      case GUI_REG_RX_DETECT :

              break;
      case GUI_REG_RX_BYTE_COUNT :

              break;
      case GUI_REG_RX_BUFFER_FRAME_TYPE :

              break;
      case GUI_REG_RX_HEADER :

              break;
      case GUI_REG_RX_DATA :

              break;
      case GUI_REG_TRANSMIT :

              break;
      case GUI_REG_TX_BYTE_COUNT :

              break;
      case GUI_REG_TX_HEADER :

              break;
      case GUI_REG_TX_DATA :

              break;
      case GUI_REG_VBUS_VOLTAGE :

              break;
      case GUI_REG_VBUS_SINK_DISCONNECT_THRESHOLD :

              break;
      case GUI_REG_VBUS_STOP_DISCHARGE_THRESHOLD :

              break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_HI_CFG :

              break;
      case GUI_REG_VBUS_VOLTAGE_ALARM_LO_CFG :

              break;
      case GUI_REG_VENDOR_DATA :

              break;
      default :
              break;
  }
  TLV_deinit_decode(&ToProcessTLV);

  TLV_ToSend_Data ToSendTLV;
  /* Generation of the empty response, as it should be done*/
  TLV_init_encode(&ToSendTLV, __GUI_SET_TAG_ID((PortNum + 1), DPM_REGISTER_WRITE_CNF), 12, pEncodedMsg);
  TLV_deinit_encode(&ToSendTLV);
}

/**
  * @brief  Manage Free text sent by the GUI
  * @param  PortNum     The current port number
  * @param  pPayload    Pointer of the text to manage
  * @param  Size        Size of the text
  * @retval USBPD Status
  */
static USBPD_StatusTypeDef Manage_FreeText(uint8_t PortNum, uint8_t *pPayload, uint16_t Size)
{
  USBPD_TRACE_Add(USBPD_TRACE_DEBUG, PortNum, 0, pPayload, Size);
  return USBPD_OK;
}

/**
  * @brief  function to wakeup TX process when sending a message.
  * @retval Timing
  */
void TRACER_EMB_WakeUpProcess(void)
{
  USBPD_DPM_TraceWakeUp();
}

